Revit 2027 API
BuiltInFailures.SketchFailures.SuggestMakingFamilyNonParametric Property
 Performance Warning: This family now contains both labeled dimensions and sketches with many segments. This may hurt performance. To improve performance, create elements that require complex sketches as nested families.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SuggestMakingFamilyNonParametric { get; }
Public Shared ReadOnly Property SuggestMakingFamilyNonParametric As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SuggestMakingFamilyNonParametric {
	FailureDefinitionId^ get ();
}
static member SuggestMakingFamilyNonParametric : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace